#МІНІСТЕРСТВО ОСВІТИ І НАУКИ УКРАІНИ
#КИЇВСЬКИЙ  УНІВЕРСИТЕТ  ІМЕНІ  БОРИСА  ГРІНЧЕНКА
#Кафедра комп'ютерних наук та математики
#Дисципліна <<АЛГОРИТМИ І СТРУКТУРИ ДАНИХ>>


#Практична робота Алгоритми роботи з підпрограмами
#Завдання: Розробити алгоритм та написати програми рішення завдання відповідно до варіанту. Оформити як підпрограми: введення даних, необхідні обчислення відповідно до алгоритму та виведення даних.

#Виконав студент групи Інб-2-21-4.0д
#Ільяш Нікіта Станіславович 
#Варіант 7

#Прийняв
#к.т.н. доцент Носенко Т.І.

#імпорт модуля math
import math
#функція для обчислення факторіалу
def factorialVar(a):
#функція повертає значення
    return math.factorial(a);
#Введення числа
n = int(input('Число:'));
print('Факторіал числа',factorialVar(n));
#Результат
# n = 5; Факторіал числа 120
#Висновок:виконав програму,яка приймає число й взводить його до факторіалу
