#МІНІСТЕРСТВО ОСВІТИ І НАУКИ УКРАІНИ
#КИЇВСЬКИЙ  УНІВЕРСИТЕТ  ІМЕНІ  БОРИСА  ГРІНЧЕНКА
#Кафедра комп'ютерних наук та математики
#Дисципліна <<АЛГОРИТМИ І СТРУКТУРИ ДАНИХ>>


#Практична робота Алгоритми роботи з підпрограмами
#Завдання: Розробити алгоритм та написати програми рішення завдання відповідно до варіанту. Оформити як підпрограми: введення даних, необхідні обчислення відповідно до алгоритму та виведення даних.

#Виконав студент групи Інб-2-21-4.0д
#Ільяш Нікіта Станіславович 
#Варіант 7

#Прийняв
#к.т.н. доцент Носенко Т.І.
#функція для обчислення площі прямокутника,яка приймає 2 значення й повертає іх у добуток
def rectangleSquare(a,b):
    return a*b;
#функція для обчислення площі прямокутного трикутника,яка приймає 3 значення й повертає площу формула
#s = 1/2 * a *b
def tringleSquare(c,d,o):
    k = c - d;
    return 0.5 * k* o;
#Ввід значеннь змінних
x = int(input('X:'));
y = int(input('Y:'));
z = int(input("Z:"));
#Вивід площі прямокутника
print('Площа прямокутника:',rectangleSquare(y,z));
#Вивід площі прямокутного трикутника
print('Площа прямокутного трикутника:',tringleSquare(x,z,y));
#Обчислення площі всієі фігури
squreAll= rectangleSquare(y,z) + tringleSquare(x,z,y);
#Вивід площі фігури
print('Вся площа фігури',squreAll);
#Результат
#x = 5;y = 4;z = 3;
#Площа прямокутника: 12
#Площа прямокутного трикутника: 4.0
#Вся площа фігури 16.0
#Висновок:зробив програму яка приймає 4(1 не використовував) сторони фігури й за допомогою 2 підпрограм обчислив площн\н
