#МІНІСТЕРСТВО ОСВІТИ І НАУКИ УКРАІНИ
#КИЇВСЬКИЙ  УНІВЕРСИТЕТ  ІМЕНІ  БОРИСА  ГРІНЧЕНКА
#Кафедра комп'ютерних наук та математики
#Дисципліна <<АЛГОРИТМИ І СТРУКТУРИ ДАНИХ>>


#Практична робота Алгоритми опрацювання двовимірних масивів
#Мета. Вивчення та набуття практичних навичок  реалізації  алгоритмів опрацювання двовимірних масивів.

#Виконав студент групи Інб-2-21-4.0д
#Рябічев Максим Олексійович
#Варіант 8

#Прийняв
#к.т.н. доцент Носенко Т.І.
#імпорт модуля Random для генерування випадкових чисел у масиві
from random import *
#Користовач вводить число для цілочисельного квадратного масиву
n = int(input('Numb:'));
#Пустий масив
arr = [];
# блок коду який створює двовимірний масив,заповнює випадковими числами й форматує його
for i in range(n):
    arr.append([1]*n)
for Row in range(n):
    for Col in range(n):
        arr[Row][Col] = randint(1, 9)
for Row in range(n):
    for Col in range(n):
        print("{0:02}".format(arr[Row][Col]), end=" ");
    print();
#Змінні(Добуток та кол-во)
s = 1;
kol = 0;
#Блок коду для обчислення добутку елементів та кількості парних елементів
for i in range(n):
    for j in range(i+1):
        d *= arr[i][j];
        if arr[i][j] % 2 == 0:
            kol = kol + 1;
print(d);
print(kol);
#Висновок:я розробив програму,я з введного числа робить масив та обраховує добуток і число парних елементів, що знаходяться під побічною діагоналлю двовимірного квадратного масиву


