#МІНІСТЕРСТВО ОСВІТИ І НАУКИ УКРАІНИ
#КИЇВСЬКИЙ  УНІВЕРСИТЕТ  ІМЕНІ  БОРИСА  ГРІНЧЕНКА
#Кафедра комп'ютерних наук та математики
#Дисципліна <<АЛГОРИТМИ І СТРУКТУРИ ДАНИХ>>

#Практична робота № 5
#Тема: <<Алгоритми опрацювання одновимірних масивів>>
#Мета:Набуття практичних навичок створення алгоритмів опрацювання одновимірних масивів
#Завдання:Дано одновимірний масив.  Розробити алгоритм та програму опрацювання масиву та передбачити контрольні результати

#Виконав студент групи Інб-2-21-4.0д
#Акопян Максим Манвелович
#Варіант №1

#Прийняв
#к.т.н. доцент Носенко Т.І.

print("Практична робота № 5");

#1 Введення елементу та кількості масиву

n = int(input("Введіть кількість елементів масиву:"));
mass = [None]*n ;
for i in range(0, n):
    mass[i] = int(input("Введите масив:"))

#2 Введення числа а
a = int(input("Введіть число a:"));

kil = 0;
sum = 0;

#3 Основний алгоритм

for i in range (0,n):
    if mass[i] > a and i % 2:
        kil=kil+1;
        sum=sum+mass[i];
print("Кількість =",kil, " ","Сума =",sum);


#4 Висновки
#Був створений алгоритм який вводить елементи массива від користовача,робить алгоритм,у якому обчислює суму та кількість елементів, які більші за а, з непарними номерами.

#5 Результати
# Масив mass = [0,2,5,6,11,15]
# a = 5
#Print Кількість= 2   Сума= 21

